sources/day_02/gmsh/cavity_with_hole/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       14929;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       14969;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       15009;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          40;
        startFace       15049;
    }
    cylinder
    {
        type            patch;
        physicalType    patch;
        nFaces          128;
        startFace       15089;
    }
    defaultFaces
    {
        type            patch;
        nFaces          19500;
        startFace       15217;
    }
)

// ************************************************************************* //
